## Knjižnica  `pandas`
**Primer: zimske olimpijske igre, Soči 2014**

Na primeru podatkov o olimpijskih igrah bomo spoznali tabelarično predstavitev podatkov (atribut-vrednost) s knjižnico `pandas`.

## Library `pandas`

**Example: Winter Olympics, Sochi 2014**

On the case of information about the Olympic Games, we will get to know the tabular presentation of the data (attribute-value) with the library `pandas`.

### Predstavitev podatkov

Tokrat imamo opravka s športniki, ki so nastopali na zimskih olimpijskih igrah v ruskem letovišču Soči ob Črnem morju leta 2014. 

Za vsakega nastopajočega športnika so na voljo naslednji podatki (atributi):

* ime in priimek,
* starost v letih,
* datum rojstva,
* spol,
* telesna višina,
* telesna teža,
* št. osvojenih zlatih medalj,
* št. osvojenih srebrnih medalj,
* št. osvojenih bronastih medalj,
* št. vseh osvojenih medalj,
* športna panoga,
* država, katero zastopa.

S kakšnim podatkovnim tipom bi predstavil/a vsakega od atributov?

### Data presentation

This time we are dealing with athletes who took part in the Winter Olympics in the Russian resort Sochi near the Black Sea in 2014.

The following data (attributes) are available for each athlete:

* name and surname,
* age in years,
* date of birth,
* gender,
* height,
* body weight,
* no. won gold medals,
* no. won silver medals,
* no. won bronze medals,
* no. of all medals won,
* The sports category,
* the country it represents.

With what kind of data type would you present each of the attributes?

Do sedaj smo spoznali načine za shranjevanje numeričnih podatkov, kot so cela in decimalna števila. Nenumerične podatke, kot so država ter naziv tekmovalca, ne moremo enostavno predstaviti v numerični obliki. Pomagali si bomo s knjižnjico `pandas`, ki poleg števil hrani lahko tudi druge tipe podatkov. Glede na tip, atribute lahko razdelimo na:

* zvezni atributi, s katerimi predstavimo številske podatke (tudi cela števila),
* ali diskretni atributi imajo zalogo vrednosti iz končne množice. Npr. spol je element množice `{moški, ženska}` ali okusi sladoleda `{čokolada, vanilija, jagoda}`. Pomni, da za razliko od števil med elementi takih množic ne obstaja urejen vrstni red.
* niz znakov poljubne (končne) dolžine.

So far, we have learned ways to store numerical data, such as integers and decimal numbers. Numerical data, such as the country and the name of the competitor, can not be easily represented in numerical form. We will use the `pandas` library, which, can also store other data types along with numbers. Depending on the type, we can classify attributes as:

* continuous attributes represent numerical data (including integers),
* discrete  attributes have a stock of values from a finite set. For example. Gender is an element of the `{man, woman}` set, or ice-cream flavors `{chocolate, vanilla, strawberry}`. Note that, unlike with numbers, there is no order between the elements of such sets. 
* string of characters of any (final) length.

Katerega od treh naštetih tipov podatkov bi uporabil za vsakega od atributov športnikov? Rešitev najdeš, če si ogledaš prvih nekaj vrstic datoteke [`athletes.tab`](podatki/athletes.tab).

Which of the three types of data would you use for each of the athletes' attributes? You can find the solution if you look at the first few lines of the file [`athletes.tab`](podatki/athletes.tab).

### Nalaganje podatkov

Podatke naložimo v spremenljivko tipa `DataFrame`. Podatkovni tipi atributov so določeni glede na vrednosti.

### Reading the data

We load the data into a variable of type `DataFrame`. The data types of attributes are assigned autimatically.

In [1]:
import pandas as pd
data = pd.read_table('../data/athletes.tab', skiprows=[1])
data

,age,birthdate,gender,height,name,weight,gold_medals,silver_medals,bronze_medals,total_medals,sport,country
0,17,1996-04-12,Male,1.72,Aaron Blunck,68,0,0,0,0,Freestyle Skiing,United States
1,27,1986-05-14,Male,1.85,Aaron March,85,0,0,0,0,Snowboard,Italy
2,21,1992-06-30,Male,1.78,Abzal Azhgaliyev,68,0,0,0,0,Short Track,Kazakhstan
3,21,1992-07-30,Male,1.86,Adam Barwood,82,0,0,0,0,Alpine Skiing,New Zealand
4,21,1992-12-18,Male,1.75,Adam Cieslar,57,0,0,0,0,Nordic Combined,Poland
...,...,...,...,...,...,...,...,...,...,...,...,...
2471,28,1985-04-30,Male,1.93,Ziga Pavlin,98,0,0,0,0,Ice Hockey,Slovenia
2472,31,1982-12-05,Female,1.70,Zina Kocher,60,0,0,0,0,Biathlon,Canada
2473,28,1985-06-14,Female,1.68,Zoe Gillings,65,0,0,0,0,Snowboard,Great Britain
2474,22,1991-03-01,Male,1.76,Zongyang Jia,68,0,0,1,1,Freestyle Skiing,China
2475,19,1995-02-06,Female,1.58,Zsofia Konya,54,0,0,0,0,Short Track,Hungary

Funkcija `info()` nam pove različne informacije o podatkih, kot so imena stolpcev in njihovi tipi.

The function `info()` tells us various information about the data, like the name of the columns and their types.

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2476 entries, 0 to 2475
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            2476 non-null   int64
 1   birthdate      2476 non-null   object
 2   gender         2476 non-null   object
 3   height         2476 non-null   float64
 4   name           2476 non-null   object
 5   weight         2476 non-null   int64
 6   gold_medals    2476 non-null   int64
 7   silver_medals  2476 non-null   int64
 8   bronze_medals  2476 non-null   int64
 9   total_medals   2476 non-null   int64
 10  sport          2476 non-null   object
 11  country        2476 non-null   object
dtypes: float64(1), int64(6), object(5)
memory usage: 232.3+ KB

Če želimo samo seznam imen stolpcev, jih lahko dobimo z atributom `columns`.

If we only want the list of column names, we can get them with the `columns` attribute.

In [3]:
data.columns

Index(['age', 'birthdate', 'gender', 'height', 'name', 'weight', 'gold_medals',
       'silver_medals', 'bronze_medals', 'total_medals', 'sport', 'country'],
      dtype='object')

Za diskretne atribute lahko dostopamo do zaloge vrednosti.

For discrete attributes we can access the set of values.

In [4]:
pd.unique(data['sport'])

array(['Freestyle Skiing', 'Snowboard', 'Short Track', 'Alpine Skiing',
       'Nordic Combined', 'Cross-Country', 'Biathlon', 'Luge',
       'Ice Hockey', 'Bobsleigh', 'Speed Skating', 'Skeleton',
       'Ski Jumping', 'Curling'], dtype=object)

Ter lahko preverimo njihovo popularnost.

And we can check their popularity.

In [5]:
data['sport'].value_counts()

sport
Ice Hockey          467
Alpine Skiing       302
Cross-Country       288
Freestyle Skiing    236
Snowboard           230
Biathlon            199
Bobsleigh           169
Speed Skating       169
Luge                107
Short Track         104
Ski Jumping          92
Nordic Combined      53
Skeleton             46
Curling              14
Name: count, dtype: int64

Lahko tudi pridobimo deleže.

We can also obtain ratios.

In [6]:
data['gender'].value_counts(normalize=True)

gender
Male      0.610258
Female    0.389742
Name: proportion, dtype: float64

### Izbira podmnožic

Do podmnožic v podatkih lahko dostopamo na različne načine.

Dostopamo lahko do vrstic na določenem mestu:

### Selecting a subset

We can select data subset in multiple ways.

We can access lines with a certain index:

In [7]:
print(data.iloc[0])
print()
print(data.iloc[3:5])

age                            17
birthdate              1996-04-12
gender                       Male
height                       1.72
name                 Aaron Blunck
weight                         68
gold_medals                     0
silver_medals                   0
bronze_medals                   0
total_medals                    0
sport            Freestyle Skiing
country             United States
Name: 0, dtype: object

   age   birthdate gender  height          name  weight  gold_medals  \
3   21  1992-07-30   Male    1.86  Adam Barwood      82            0
4   21  1992-12-18   Male    1.75  Adam Cieslar      57            0

   silver_medals  bronze_medals  total_medals            sport      country
3              0              0             0    Alpine Skiing  New Zealand
4              0              0             0  Nordic Combined       Poland

Dostopamo lahko do atributov posamezne vrstice.
Navedeni načini so ekvivalentni za dostop do športa športnika v prvi vrstici:

We can access the attributes of each line.
These modes are equivalent to accessing the sport on the sportsman in the first line:

In [8]:
print(data.iloc[0, 10])
print(data.loc[0, 'sport'])

Freestyle Skiing
Freestyle Skiing

Dostopamo tudi do več stolpcev hkrati:

We also access multiple columns at the same time:

In [9]:
print(data.loc[0, ['name','sport', 'country']])
print()
print(data.iloc[0, [4,10,11]])

name           Aaron Blunck
sport      Freestyle Skiing
country       United States
Name: 0, dtype: object

name           Aaron Blunck
sport      Freestyle Skiing
country       United States
Name: 0, dtype: object

Z uporabo pogojev lahko izpišemo le vrstice, ki izpolnjujejo ta pogoj.

By using conditions, we can display only the rows that meet that condition.

In [10]:
data.loc[data['sport'] == 'Alpine Skiing']

,age,birthdate,gender,height,name,weight,gold_medals,silver_medals,bronze_medals,total_medals,sport,country
3,21,1992-07-30,Male,1.86,Adam Barwood,82,0,0,0,0,Alpine Skiing,New Zealand
5,18,1995-04-22,Male,1.70,Adam Lamhamedi,76,0,0,0,0,Alpine Skiing,Morocco
6,23,1990-09-13,Male,1.78,Adam Zampa,80,0,0,0,0,Alpine Skiing,Slovakia
7,21,1992-09-28,Female,1.62,Adeline Baud,56,0,0,0,0,Alpine Skiing,France
10,29,1984-09-18,Male,1.82,Adrien Theaux,80,0,0,0,0,Alpine Skiing,France
...,...,...,...,...,...,...,...,...,...,...,...,...
2420,19,1994-12-20,Male,1.81,Yohan Goncalves Goutt,78,0,0,0,0,Alpine Skiing,Timor-Leste
2425,16,1997-07-19,Female,1.68,Young-seo Kang,60,0,0,0,0,Alpine Skiing,Korea
2451,24,1989-02-20,Male,1.82,Yuxin Zhang,71,0,0,0,0,Alpine Skiing,China
2458,21,1992-11-15,Male,1.76,Zan Kranjec,77,0,0,0,0,Alpine Skiing,Slovenia
2459,28,1985-06-24,Female,1.64,Zana Novakovic,58,0,0,0,0,Alpine Skiing,Bosnia and Herzegovina

##### Vprašanje 1-2-1

Pogoji so lahko tudi bolj kompleksni. Izpišite vse športnike, ki so zmagali zlato IN srebrno medaljo.

##### Question 1-2-1

Conditions can also be more complex. List all athletes who have won both a gold AND a silver medal.

[Odgovor](201-2.ipynb#Odgovor-1-2-1)

[Answer](201-2.ipynb#Answer-1-2-1)

### Dodajanje novih stolpcev

Podatkom lahko enostavno dodamo nove stolpce. Vrednosti novih stolpcev so lahko vezane na vsebino že obstoječih stolpcev.

### Adding new columns

We can easily add new columns to the data. The values of the new columns can be based on the contents of existing columns.

In [11]:
data['age_group'] = pd.cut(data['age'], [0, 20, 30, 40, 100], labels=["<20", "20-30", "30-40", "40+"])
data.head()

,age,birthdate,gender,height,name,weight,gold_medals,silver_medals,bronze_medals,total_medals,sport,country,age_group
0,17,1996-04-12,Male,1.72,Aaron Blunck,68,0,0,0,0,Freestyle Skiing,United States,<20
1,27,1986-05-14,Male,1.85,Aaron March,85,0,0,0,0,Snowboard,Italy,20-30
2,21,1992-06-30,Male,1.78,Abzal Azhgaliyev,68,0,0,0,0,Short Track,Kazakhstan,20-30
3,21,1992-07-30,Male,1.86,Adam Barwood,82,0,0,0,0,Alpine Skiing,New Zealand,20-30
4,21,1992-12-18,Male,1.75,Adam Cieslar,57,0,0,0,0,Nordic Combined,Poland,20-30

##### Vprašanje 1-2-2

Dodajte stolpec, ki izračuna [ITM](https://sl.wikipedia.org/wiki/Indeks_telesne_mase) športnikov.

##### Question 1-2-2

Add a column that calculates the [BMI](https://en.wikipedia.org/wiki/Body_mass_index) of the athletes.

[Odgovor](201-2.ipynb#Odgovor-1-2-2)

[Answer](201-2.ipynb#Answer-1-2-2)

### Osnovne informacije o podatkih

Funkcija `describe()` nam pove osnovne statistike za numerične atribute.

### Functions for data work

The  `describe()` function tells us various statistics about numerical attributes.

In [12]:
data.describe()

,age,height,weight,gold_medals,silver_medals,bronze_medals,total_medals
count,2476.000000,2476.000000,2476.000000,2476.000000,2476.000000,2476.000000,2476.000000
mean,25.974152,1.757371,73.113893,0.029887,0.029887,0.030291,0.090065
std,4.976159,0.090514,13.673625,0.194665,0.177284,0.180603,0.342843
min,15.000000,1.500000,40.000000,0.000000,0.000000,0.000000,0.000000
25%,22.000000,1.690000,62.000000,0.000000,0.000000,0.000000,0.000000
50%,26.000000,1.760000,72.000000,0.000000,0.000000,0.000000,0.000000
75%,29.000000,1.830000,83.000000,0.000000,0.000000,0.000000,0.000000
max,55.000000,2.060000,120.000000,3.000000,2.000000,2.000000,3.000000

Vrstice lahko uredimo glede na vrednost atributa.

Rows can be sorted according to the value of an attribute.

In [13]:
data.sort_values(by='total_medals', ascending=False).head(10)[['name', 'sport', 'country', 'total_medals']]

                  name          sport       country  total_medals
1482   Martin Fourcade       Biathlon        France             3
911         Irene Wust  Speed Skating   Netherlands             3
265    Arianna Fontana    Short Track         Italy             3
424    Charlotte Kalla  Cross-Country        Sweden             3
528   Darya Domracheva       Biathlon       Belarus             3
1098    Jorrit Bergsma  Speed Skating   Netherlands             2
31    Albert Demchenko           Luge  Russian Fed.             2
2173       Sukhee Shim    Short Track         Korea             2
1863       Peter Prevc    Ski Jumping      Slovenia             2
2183       Sven Kramer  Speed Skating   Netherlands             2

S `crosstab()` pridobimo število pojavitev za posamezne pare elementov dveh stributov.

With `crosstab()` we obtain the number of occurrences for each pair of elements of two attributes.

In [14]:
pd.crosstab(data['country'],data['sport'])

sport,Alpine Skiing,Biathlon,Bobsleigh,Cross-Country,Curling,Freestyle Skiing,Ice Hockey,Luge,Nordic Combined,Short Track,Skeleton,Ski Jumping,Snowboard,Speed Skating
country,,,,,,,,,,,,,,
Albania,2,0,0,0,0,0,0,0,0,0,0,0,0,0
Andorra,4,1,0,0,0,0,0,0,0,0,0,0,1,0
Armenia,1,0,0,3,0,0,0,0,0,0,0,0,0,0
Australia,5,2,6,4,0,21,0,1,0,2,3,0,11,1
Austria,20,9,6,8,0,10,25,10,5,1,3,7,17,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Ukraine,2,11,0,8,0,4,0,6,1,1,0,0,2,0
United States,20,10,14,14,2,24,46,10,4,8,5,7,23,17
Uzbekistan,2,0,0,0,0,0,0,0,0,0,0,0,0,0
Venezuela,1,0,0,0,0,0,0,0,0,0,0,0,0,0
Zimbabwe,1,0,0,0,0,0,0,0,0,0,0,0,0,0

### Združevanje in agregiranje

Na tabeli lahko uporabimo tudi združevalne in agregatne funkcije.

Koliko zlatih, srebrnih, bronastih medalj je zmagala posamezna država?

### Grouping and Aggregation

We can also use grouping and aggregation functions on the table.

How many gold, silver, and bronze medals did each country win?

In [15]:
data.groupby('country')[['gold_medals', 'silver_medals', 'bronze_medals']].sum()

               gold_medals  silver_medals  bronze_medals
country
Albania                  0              0              0
Andorra                  0              0              0
Armenia                  0              0              0
Australia                0              2              1
Austria                  1             10              1
...                    ...            ...            ...
Ukraine                  0              0              1
United States            4              4             10
Uzbekistan               0              0              0
Venezuela                0              0              0
Zimbabwe                 0              0              0

[83 rows x 3 columns]

In [16]:
medals_by_country = data[['country', 'gold_medals', 'silver_medals', 'bronze_medals']].groupby('country').sum()
medals_by_country

               gold_medals  silver_medals  bronze_medals
country
Albania                  0              0              0
Andorra                  0              0              0
Armenia                  0              0              0
Australia                0              2              1
Austria                  1             10              1
...                    ...            ...            ...
Ukraine                  0              0              1
United States            4              4             10
Uzbekistan               0              0              0
Venezuela                0              0              0
Zimbabwe                 0              0              0

[83 rows x 3 columns]

In [17]:
medals_by_country = data[['country', 'gold_medals', 'silver_medals', 'bronze_medals']].groupby('country').aggregate('sum')
medals_by_country

               gold_medals  silver_medals  bronze_medals
country
Albania                  0              0              0
Andorra                  0              0              0
Armenia                  0              0              0
Australia                0              2              1
Austria                  1             10              1
...                    ...            ...            ...
Ukraine                  0              0              1
United States            4              4             10
Uzbekistan               0              0              0
Venezuela                0              0              0
Zimbabwe                 0              0              0

[83 rows x 3 columns]

In [18]:
medals_by_country = data[['country', 'gold_medals', 'silver_medals', 'bronze_medals']].groupby('country').agg('sum')
medals_by_country

               gold_medals  silver_medals  bronze_medals
country
Albania                  0              0              0
Andorra                  0              0              0
Armenia                  0              0              0
Australia                0              2              1
Austria                  1             10              1
...                    ...            ...            ...
Ukraine                  0              0              1
United States            4              4             10
Uzbekistan               0              0              0
Venezuela                0              0              0
Zimbabwe                 0              0              0

[83 rows x 3 columns]

##### Vprašanje 1-2-3

Kateri športi imajo najmlajše in kateri najstarejše nastopajoče?

##### Question 1-2-3

Which sports have the youngest and which have the oldest participants?

[Odgovor](201-2.ipynb#Odgovor-1-2-3)

[Answer](201-2.ipynb#Answer-1-2-3)

### Delo z datumi

Če želimo računati z datumom rojstva tako, kot je trenutno zapisan (tip `object`), se bomo morali pomatrati. Kako dobimo leto rojstva?

### Working with dates

If we want to perform calculations with the date of birth as it is currently written (type `object`), we will have to put in some effort. How do we get the year of birth?

In [19]:
year = data['birthdate'].str[:4].astype(int)
year.head(5)

0    1996
1    1986
2    1992
3    1992
4    1992
Name: birthdate, dtype: int32

Stolpec z dnevom rojstva spremenimo v tip `datetime`.

We convert the column with the date of birth to the `datetime` type.

In [20]:
data['birthdate'] = pd.to_datetime(data['birthdate'])
data.head()

,age,birthdate,gender,height,name,weight,gold_medals,silver_medals,bronze_medals,total_medals,sport,country,age_group
0,17,1996-04-12,Male,1.72,Aaron Blunck,68,0,0,0,0,Freestyle Skiing,United States,<20
1,27,1986-05-14,Male,1.85,Aaron March,85,0,0,0,0,Snowboard,Italy,20-30
2,21,1992-06-30,Male,1.78,Abzal Azhgaliyev,68,0,0,0,0,Short Track,Kazakhstan,20-30
3,21,1992-07-30,Male,1.86,Adam Barwood,82,0,0,0,0,Alpine Skiing,New Zealand,20-30
4,21,1992-12-18,Male,1.75,Adam Cieslar,57,0,0,0,0,Nordic Combined,Poland,20-30

Kaj se je spremenilo?

What changed?

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2476 entries, 0 to 2475
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            2476 non-null   int64
 1   birthdate      2476 non-null   datetime64[ns]
 2   gender         2476 non-null   object
 3   height         2476 non-null   float64
 4   name           2476 non-null   object
 5   weight         2476 non-null   int64
 6   gold_medals    2476 non-null   int64
 7   silver_medals  2476 non-null   int64
 8   bronze_medals  2476 non-null   int64
 9   total_medals   2476 non-null   int64
 10  sport          2476 non-null   object
 11  country        2476 non-null   object
 12  age_group      2476 non-null   category
dtypes: category(1), datetime64[ns](1), float64(1), int64(6), object(4)
memory usage: 234.9+ KB

Kako pa sedaj dobimo leto rojstva?

How do we now get the year of birth?

In [22]:
year = data['birthdate'].dt.year
year.head(5)

0    1996
1    1986
2    1992
3    1992
4    1992
Name: birthdate, dtype: int32

Lahko tudi enostavno ugotovimo, na kateri dan se je nekdo rodil.

We can also easily find out on which day someone was born.

In [23]:
day = data['birthdate'].dt.day_name()
day.head()

0       Friday
1    Wednesday
2      Tuesday
3     Thursday
4       Friday
Name: birthdate, dtype: object

##### Vprašanje 1-2-4

Kateri športniki so rojeni v 80ih letih?

##### Question 1-2-4

Which athletes were born in the 80s?

[Odgovor](201-2.ipynb#Odgovor-1-2-4)

[Answer](201-2.ipynb#Answer-1-2-4)